Revit 2027 API
BuiltInFailures.RebarShapeFailures.CircleMultiPlanarShape Property
 A circle can't be converted to multiplanar shape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CircleMultiPlanarShape { get; }
Public Shared ReadOnly Property CircleMultiPlanarShape As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CircleMultiPlanarShape {
	FailureDefinitionId^ get ();
}
static member CircleMultiPlanarShape : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarShapeFailures Class
Autodesk.Revit.DB Namespace